<?php

namespace $namespace;

use Yii;
use Throwable;

class $className {
    /**
     *  Это сервис брат
     *  че тут и как делать, спросишь?
     * 
     *  я без понятия, я только сделал шаблон
     */

    public function __construct(){
        /**
         *  тут делаешь че то
         */
    }

    /**
     * тут короче используешь сервис и делаешь че то
     * лучше всего использовать через статические методы (грязи меньше)
     */

    public function __destruct(){
        /**
         *  тут делаешь че то
         */
    }
}